---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewScalePulldownMetric
source: html/d934d4d7-e47d-c800-a369-9ab50d1abfc0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewScalePulldownMetric Property

"View Scale"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewScalePulldownMetric { get; }
```